backend/app/Services/CustomerInsightsService.php

    private function analyzePurchaseBehavior(int $customerId): array
    {
        $orders = Order::where('user_id', $customerId)
            ->where('status', 'completed')
            ->orderBy('created_at')
            ->get();
---
select * from `orders` where `user_id` = 3 and `status` = 'completed' and `orders`.`deleted_at` is null order by `created_at` asc

    private function getFavoriteCategories(int $customerId): array
    {
        $categoryStats = DB::table('order_items')
            ->join('orders', 'order_items.order_id', '=', 'orders.id')
            ->join('products', 'order_items.product_id', '=', 'products.id')
            ->leftJoin('categories', 'products.category_id', '=', 'categories.id')
            ->where('orders.user_id', $customerId)
            ->where('orders.status', 'completed')
            ->select(
                'categories.id as category_id',
                'categories.name as category_name',
                DB::raw('COUNT(DISTINCT order_items.order_id) as order_count'),
                DB::raw('SUM(order_items.quantity * order_items.unit_price) as total_spent'),
                DB::raw('MAX(orders.created_at) as last_purchase')
            )
            ->groupBy('categories.id', 'categories.name')
            ->get();
---
select `categories`.`id` as `category_id`, `categories`.`name` as `category_name`, COUNT(DISTINCT order_items.order_id) as order_count, SUM(order_items.quantity * order_items.unit_price) as total_spent, MAX(orders.created_at) as last_purchase from `order_items` inner join `orders` on `order_items`.`order_id` = `orders`.`id` inner join `products` on `order_items`.`product_id` = `products`.`id` left join `categories` on `products`.`category_id` = `categories`.`id` where `orders`.`user_id` = 3 and `orders`.`status` = 'completed' group by `categories`.`id`, `categories`.`name`

    private function getFavoriteProducts(int $customerId): array
    {
        $productStats = DB::table('order_items')
            ->join('orders', 'order_items.order_id', '=', 'orders.id')
            ->join('products', 'order_items.product_id', '=', 'products.id')
            ->where('orders.user_id', $customerId)
            ->where('orders.status', 'completed')
            ->select(
                'products.id',
                'products.name',
                'products.price',
                'products.image_url',
                DB::raw('COUNT(order_items.id) as order_count'),
                DB::raw('SUM(order_items.quantity) as total_quantity'),
                DB::raw('MAX(orders.created_at) as last_purchase')
            )
            ->groupBy('products.id', 'products.name', 'products.price', 'products.image_url')
            ->orderByDesc('order_count')
            ->limit(5)
            ->get();
---
select `products`.`id`, `products`.`name`, `products`.`price`, `products`.`image_url`, COUNT(order_items.id) as order_count, SUM(order_items.quantity) as total_quantity, MAX(orders.created_at) as last_purchase from `order_items` inner join `orders` on `order_items`.`order_id` = `orders`.`id` inner join `products` on `order_items`.`product_id` = `products`.`id` where `orders`.`user_id` = 3 and `orders`.`status` = 'completed' group by `products`.`id`, `products`.`name`, `products`.`price`, `products`.`image_url` order by `order_count` desc limit 5

    private function analyzeProductCombinations(int $customerId): array
    {
        // Get orders with multiple items
        $orders = Order::where('user_id', $customerId)
            ->where('status', 'completed')
            ->with('orderItems.product')
            ->get();
---
select * from `orders` where `user_id` = 3 and `status` = 'completed' and `orders`.`deleted_at` is null

    private function discoverTasteProfile(int $customerId): array
    {
        // Get coffee-related purchases
        $coffeeOrders = DB::table('order_items')
            ->join('orders', 'order_items.order_id', '=', 'orders.id')
            ->join('products', 'order_items.product_id', '=', 'products.id')
            ->leftJoin('categories', 'products.category_id', '=', 'categories.id')
            ->where('orders.user_id', $customerId)
            ->where('orders.status', 'completed')
            ->where(function($query) {
                $query->where('categories.name', 'like', '%coffee%')
                      ->orWhere('products.name', 'like', '%coffee%')
                      ->orWhere('products.description', 'like', '%roast%');
            })
            ->select('products.name', 'products.description')
            ->get();
---
select `products`.`name`, `products`.`description` from `order_items` inner join `orders` on `order_items`.`order_id` = `orders`.`id` inner join `products` on `order_items`.`product_id` = `products`.`id` left join `categories` on `products`.`category_id` = `categories`.`id` where `orders`.`user_id` = 3 and `orders`.`status` = 'completed' and (`categories`.`name` like '%coffee%' or `products`.`name` like '%coffee%' or `products`.`description` like '%roast%')

    private function calculateEngagementScore(int $customerId): array
    {
        $user = User::findOrFail($customerId);
        $orders = Order::where('user_id', $customerId)
            ->where('status', 'completed')
            ->where('created_at', '>=', now()->subDays(90))
            ->get();

        // 1. Purchase Frequency (30%)
        $frequencyScore = ($orders->count() / 90) * 100;
        $frequencyScore = min(100, $frequencyScore * 10); // Normalize

        // 2. Monetary Value (25%)
        $totalSpent = $orders->sum('total_amount');
        $avgCustomerSpent = Order::where('status', 'completed')
            ->where('created_at', '>=', now()->subDays(90))
            ->avg('total_amount') * 10; // Approximate avg per customer
        $monetaryScore = min(100, ($totalSpent / max(1, $avgCustomerSpent)) * 100);

        // 3. Recency (20%)
        $lastOrder = $orders->sortByDesc('created_at')->first();
        $recencyScore = $lastOrder
            ? max(0, 100 - $lastOrder->created_at->diffInDays(now()))
            : 0;

        // 4. Product Diversity (15%)
        $uniqueProducts = OrderItem::whereIn('order_id', $orders->pluck('id'))
            ->distinct('product_id')
            ->count('product_id');
        $totalProducts = Product::where('is_available', true)->count();
---
select * from `users` where `users`.`id` = 3 and `users`.`deleted_at` is null limit 1
select * from `orders` where `user_id` = 3 and `status` = 'completed' and `created_at` >= '2025-09-11 04:44:05' and `orders`.`deleted_at` is null
select avg(`total_amount`) as aggregate from `orders` where `status` = 'completed' and `created_at` >= '2025-09-11 04:44:05' and `orders`.`deleted_at` is null
select count(*) as aggregate from `products` where `is_available` = 1 and `products`.`deleted_at` is null

    private function analyzeSatisfaction(int $customerId): array
    {
        $score = 0;
        $signals = [];

        $orders = Order::where('user_id', $customerId)
            ->where('status', 'completed')
            ->orderBy('created_at')
            ->get();
---
select * from `orders` where `user_id` = 3 and `status` = 'completed' and `orders`.`deleted_at` is null order by `created_at` asc

    private function generatePredictions(int $customerId): array
    {
        $orders = Order::where('user_id', $customerId)
            ->where('status', 'completed')
            ->orderBy('created_at')
            ->get();
---
select * from `orders` where `user_id` = 3 and `status` = 'completed' and `orders`.`deleted_at` is null order by `created_at` asc

    private function identifyLifecycleStage(int $customerId): array
    {
        $user = User::findOrFail($customerId);
        $orders = Order::where('user_id', $customerId)
            ->where('status', 'completed')
            ->orderBy('created_at')
            ->get();
---
select * from `users` where `users`.`id` = 3 and `users`.`deleted_at` is null limit 1
select * from `orders` where `user_id` = 3 and `status` = 'completed' and `orders`.`deleted_at` is null order by `created_at` asc