backend/app/Http/Controllers/Api/V1/AuthController.php

select * from `users` where `email` = 'customer@arbiter.com' limit 1
---
    public function login(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'email' => 'required|email',
            'password' => 'required',
        ]);

        if ($validator->fails()) {
            return $this->sendValidationError($validator->errors()->toArray());
        }

        $email = $request->input('email');
        $password = $request->input('password');

        $user = User::where('email', $email)->first();