backend/app/Http/Controllers/Api/V1/CoffeeBeanController.php

    public function update(Request $request, $id)
    {
        $bean = CoffeeBean::find($id);
---
select * from `coffee_beans` where `coffee_beans`.`id` = '2' and `coffee_beans`.`deleted_at` is null limit 1