backend/app/Http/Controllers/Api/V1/FeaturedOriginController.php

select * from `coffee_beans` where `coffee_beans`.`id` in (1) and `coffee_beans`.`deleted_at` is null
---
    public function getByDate(Request $request)
    {
        try {
            $validator = Validator::make($request->all(), [
                'date' => 'required|date',
            ]);

            if ($validator->fails()) {
                return $this->sendValidationError($validator->errors()->toArray());
            }

            $featuredOrigins = DailyFeaturedOrigin::with('coffeeBean')
                ->byDate($request->input('date'))
                ->orderBy('start_time')
                ->get();

select * from `coffee_beans` where `coffee_beans`.`id` in (1, 2) and `coffee_beans`.`deleted_at` is null
select * from `daily_featured_origins` order by `feature_date` desc, `start_time` asc limit 20 offset 0
select count(*) as aggregate from `daily_featured_origins`
---
    public function index(Request $request)
    {
        try {
            $query = DailyFeaturedOrigin::with(['coffeeBean', 'creator']);

            // Filter by date range
            if ($request->has('start_date')) {
                $query->where('feature_date', '>=', $request->input('start_date'));
            }

            if ($request->has('end_date')) {
                $query->where('feature_date', '<=', $request->input('end_date'));
            }

            // Filter by active status
            if ($request->has('is_active')) {
                $query->where('is_active', $request->boolean('is_active'));
            }

            $featuredOrigins = $query->orderBy('feature_date', 'desc')
                ->orderBy('start_time')
                ->paginate(20);