backend/app/Http/Controllers/Api/AdminController.php

    public function getDashboardStats()
    {
        try {
            $stats = [
                'totalOrders' => Order::count(),
                'totalUsers' => User::count(),
                'totalProducts' => Product::count(),
                'totalRevenue' => Order::where('payment_status', 'paid')->sum('total_amount'),
            ];

            // Get recent orders
            $recentOrders = Order::with(['user', 'orderItems'])
                ->orderBy('created_at', 'desc')
                ->limit(10)
                ->get();
---
select sum(`total_amount`) as aggregate from `orders` where `payment_status` = 'paid' and `orders`.`deleted_at` is null
select count(*) as aggregate from `users`
select count(*) as aggregate from `products` where `products`.`deleted_at` is null
select * from `order_items` where `order_items`.`order_id` in (1, 2, 3)
select * from `orders` where `orders`.`deleted_at` is null order by `created_at` desc limit 10
select * from `users` where `users`.`id` in (3)