backend/app/Http/Controllers/Api/BaristaController.php

    public function listCoffeeBeans()
    {
        try {
            $beans = CoffeeBean::orderBy('name', 'asc')->get();
---
select * from `coffee_beans` where `coffee_beans`.`deleted_at` is null order by `name` asc

    public function getPerformance(Request $request)
    {
        try {
            $user = Auth::user();
            $period = $request->input('period', 'today');

            $query = Order::where('barista_id', $user->id);

            if ($period === 'today') {
                $query->whereDate('created_at', today());
            } elseif ($period === 'week') {
                $query->whereBetween('created_at', [now()->startOfWeek(), now()->endOfWeek()]);
            } elseif ($period === 'month') {
                $query->whereMonth('created_at', now()->month);
            }

            $stats = [
                'orders_completed' => $query->where('status', 'completed')->count(),
                'total_orders' => $query->count(),
                'avg_preparation_time' => $query->avg('preparation_time') ?? 0,
                'customer_ratings' => $query->avg('rating') ?? 0,
                'period' => $period,
            ];
---
select count(*) as aggregate from `orders` where `barista_id` = 2 and date(`created_at`) = '2025-12-09' and `status` = 'completed' and `orders`.`deleted_at` is null