backend/app/Http/Controllers/Api/CartController.php

select * from `carts` where (`user_id` = 1) limit 1
select * from `cart_items` where `cart_id` = 1
---
    public function index()
    {
        try {
            $user = Auth::user();

            // Get or create cart for user
            $cart = Cart::firstOrCreate(
                ['user_id' => $user->id],
                ['user_id' => $user->id]
            );

            $cartItems = CartItem::where('cart_id', $cart->id)
                ->with('product')
                ->get();

select * from "carts" where "user_id" = 4 limit 1
select * from "cart_items" where "cart_id" = 1 and "id" = '1' limit 1
delete from "cart_items" where "id" = 1
---
    public function removeItem($id)
    {
        try {
            $user = Auth::user();
            $cart = Cart::where('user_id', $user->id)->first();

            if (!$cart) {
                return $this->sendError('Cart not found', 404);
            }

            $cartItem = CartItem::where('cart_id', $cart->id)
                ->where('id', $id)
                ->first();

            if (!$cartItem) {
                return $this->sendError('Cart item not found', 404);
            }

            $cartItem->delete();