backend/app/Http/Controllers/Api/CustomerController.php

    public function dashboard()
    {
        try {
            $user = Auth::user();

            // Get customer statistics
            $totalOrders = Order::where('user_id', $user->id)->count();
            $completedOrders = Order::where('user_id', $user->id)
                ->where('status', 'completed')
                ->count();
            $activeOrders = Order::where('user_id', $user->id)
                ->whereIn('status', ['pending', 'preparing'])
                ->count();
            $totalSpent = Order::where('user_id', $user->id)
                ->where('payment_status', 'paid')
                ->sum('total_amount');

            // Get recent orders
            $recentOrders = Order::where('user_id', $user->id)
                ->with(['orderItems.product'])
                ->orderBy('created_at', 'desc')
                ->limit(5)
                ->get();

            // Get active order (if any)
            $activeOrder = Order::where('user_id', $user->id)
                ->whereIn('status', ['pending', 'preparing'])
                ->with(['orderItems.product'])
                ->first();
---
select count(*) as aggregate from `orders` where `user_id` = 3 and `orders`.`deleted_at` is null
select count(*) as aggregate from `orders` where `user_id` = 3 and `status` = 'completed' and `orders`.`deleted_at` is null
select count(*) as aggregate from `orders` where `user_id` = 3 and `status` in ('pending', 'preparing') and `orders`.`deleted_at` is null
select sum(`total_amount`) as aggregate from `orders` where `user_id` = 3 and `payment_status` = 'paid' and `orders`.`deleted_at` is null
select * from `order_items` where `order_items`.`order_id` in (1, 2, 3)
select * from `orders` where `user_id` = 3 and `orders`.`deleted_at` is null order by `created_at` desc limit 5
select * from `products` where `products`.`id` in (2) and `products`.`deleted_at` is null
select * from `order_items` where `order_items`.`order_id` in (2)
select * from `orders` where `user_id` = 3 and `status` in ('pending', 'preparing') and `orders`.`deleted_at` is null limit 1

    public function getFavorites()
    {
        try {
            $user = Auth::user();

            // Get favorite products with full product details
            $favorites = DB::table('customer_favorites')
                ->join('products', 'customer_favorites.product_id', '=', 'products.id')
                ->leftJoin('categories', 'products.category_id', '=', 'categories.id')
                ->where('customer_favorites.user_id', $user->id)
                ->where('products.is_available', true)
                ->select(
                    'customer_favorites.id as favorite_id',
                    'products.id',
                    'products.name',
                    'products.description',
                    'products.price',
                    'products.image_url',
                    'products.category_id',
                    'categories.name as category_name',
                    'customer_favorites.created_at as favorited_at'
                )
                ->orderBy('customer_favorites.created_at', 'desc')
                ->get();
---
select `products`.`id`, `products`.`name`, `products`.`description`, `products`.`price`, `products`.`image_url`, `products`.`category_id`, `categories`.`name` as `category_name`, `customer_favorites`.`created_at` as `favorited_at` from `customer_favorites` inner join `products` on `customer_favorites`.`product_id` = `products`.`id` left join `categories` on `products`.`category_id` = `categories`.`id` where `customer_favorites`.`user_id` = 3 and `products`.`is_available` = 1 order by `customer_favorites`.`created_at` desc

    public function toggleFavorite(Request $request)
    {
        try {
            $user = Auth::user();

            if (!$user) {
                return response()->json([
                    'success' => false,
                    'message' => 'Authentication required'
                ], 401);
            }

            $request->validate([
                'product_id' => 'required|integer|exists:products,id'
            ]);

            $productId = $request->product_id;

            // Check if product exists and is available
            $product = Product::where('id', $productId)
                ->where('is_available', true)
                ->first();
---
select * from `products` where `id` = 2 and `is_available` = 1 and `products`.`deleted_at` is null limit 1

            }

            // Check if already favorited
            $exists = DB::table('customer_favorites')
                ->where('user_id', $user->id)
                ->where('product_id', $productId)
                ->exists();
---
select exists(select * from `customer_favorites` where `user_id` = 3 and `product_id` = 2) as `exists`

                ]);
            } else {
                // Add to favorites
                DB::table('customer_favorites')->insert([
                    'user_id' => $user->id,
                    'product_id' => $productId,
                    'created_at' => \Carbon\Carbon::now(),
                    'updated_at' => \Carbon\Carbon::now()
                ]);
---
insert into `customer_favorites` (`user_id`, `product_id`, `created_at`, `updated_at`) values (3, 2, '2025-12-10 04:45:10', '2025-12-10 04:45:10')