backend/app/Http/Controllers/Api/OrderController.php

select * from `order_items` where `order_items`.`order_id` in (1, 2)
select * from `orders` where `user_id` = 3 and `orders`.`deleted_at` is null order by `created_at` desc limit 15 offset 0
select * from `products` where `products`.`id` in (2) and `products`.`deleted_at` is null
---
    public function show($id)
    {
        try {
            $user = Auth::user();

            $order = Order::where('user_id', $user->id)
                ->where('id', $id)
                ->with(['orderItems.product', 'user'])
                ->first();

select * from `order_items` where `order_items`.`order_id` in (1)
select * from `orders` where `user_id` = 3 and `id` = '1' and `orders`.`deleted_at` is null limit 1
select * from `products` where `products`.`id` in (2) and `products`.`deleted_at` is null
---
    public function reorder($id)
    {
        try {
            $user = Auth::user();

            // Get original order with eager loaded relationships
            $originalOrder = Order::where('user_id', $user->id)
                ->where('id', $id)
                ->with(['orderItems.product'])
                ->first();