backend/app/Http/Controllers/Api/OrderController.php

    public function show($id)
    {
        try {
            $user = Auth::user();

            $order = Order::where('user_id', $user->id)
                ->where('id', $id)
                ->with(['orderItems.product', 'user', 'deliveryAddress'])
                ->first();
---
select * from `addresses` where `addresses`.`id` in (2)
select * from `users` where `users`.`id` in (3)